<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>paragraph</title>
</head>
    <!-- ? c++ c-- 키를 누르면 화면에 맞추어 글자 크기가 맞추어 지기 때문에 본인 눈에 맞추어 데이어 셋을 하시면 오타가 줄어든다-->
<body>
    <p>
        <!-- !단락(Paragraph)(=글의 한 토막) 은 브라우저에서 위 아래로 빈 줄을 자동으로 추가하여 하나의 분리된 글 임을 표시한다 -->
        <!-- 기능 : 여러 개의 p태그를 중첩해 여러 문단을 만들 수 있으며, 각 문단은 브라우저에서 자동으로 한 줄씩 띄워져 구분됩니다. -->
        <!-- 블럭 요소 : p태그는 한 줄 전체를 차지하며 단락요소, 줄바꿈이 필요할 때 적합합니다. 문장을 구분할 때 사용적합-->
        문단 <br>
        <b>진하게</b>
        <strong>진하게(의미강조)</strong> <br>
        <!-- 눈이 보이는 사람과, 눈에 보이지 않는 사람 처음만들 때 차별 없는 구조를 만들자 근데 서서희 차별이 생기기 시작했음 -->
        <!-- 외국은 눈이 안 보이는 사람들에게 무료 제공, 우리나라 회사가 300~400 사야함 눈이 안 보이는 사람은 힘들어짐[접근성을 잘 하는 애들을 뽑으려함] -->
        <!-- 시각정, 청각적으로 성조로 강조 기계음 으로 스트롱으로 이야기의 높 낮이라도 나옴 다행 이거를 바꿀 수 있는 사람은 퍼플리셔가해야함-->
        <!-- 그래서 저희는[접근성, 웹 표준, 적응도, 반응성] 배우게 됨 그것의 첫번째 -->
        
        <i>기울기</i>
        <em>기울기(의미강조)</em>
        <!-- ?외국어나 분류적 성격이 강한 단어, 전문기술용어, 손글씨등에 다른 글자와 구별되는 것들을 표현시 사용, -->
        
        <mark>색상</mark>
        <!-- ?배경색상이 아닌 글자 색상을 변경할 시에 쓰기 유용, 순정상태 가장 강한 보색대비 눈에 안 보이는 배려 [검, 노] -->
        <!-- 최근은 아니지만 대략 최근에 만들어진 태그 죽은 태그 살아있는 태그 설명필요  -->
        <!-- vs코드는 마이크로 소프트웨어에서 만듬 -->

        <sup>위</sup>첨자
        <sub>아래</sub>첨자 <br>

        <s>취소선</s>
        <del>취소선(실제 data 상의 이전 / 삭제값)</del> <br>
        <!-- 원래 의미는 취소의 의미로 사용한게 하니고 스트라이크라고 만든 태그 -->
        <!-- s는 아무 의미가 없음, 근데 del은 변경되기 이전의 내용을 담아있다 그래서 이태그는 조금 중요하다 자주 씀-->

        <u>밑줄</u> <br>
        <!-- ?바 강조 : 단순한 underline -->
        <!-- 위에 있는 태그에 비해서는 역활 자체는 없고 생김새만 존재하기 때문에 큰 의미는 없음 -->
        
        일부를<small>작게</small>
        일부를<big>크게</big> <br>
        <!-- 죽은 애들을 색상이 이상하다 그리고 마크업 단어가 안 뜬다 / 안 사용하기는 하지만 그냥 쓰기도 함 / 가장 아까운 태그중 하나 -->
        <!-- 조금 작극 구조를 줄때 big 가장 좋았는데 이런 애들을 태체해서 사용해야한다는게 아쉽  -->
        <!-- 이런 태그들이 앞으로 태어날수 있다는 거 그래서 퍼브릴셔도 항상 살펴봐야 한다 시대에 맞춰서 태어 날수도 있는 태그들에 대해서 민감하게 반응해야한다-->

        <kbd>키보드 활자</kbd>
        <code>컴퓨터 코드</code>
        <samp>프로그램 처리 결과 표시</samp>
    </p>
    <hr>
    <!-- ! hr 태그(horizontal rule)는 위와 아래의 주제 자체가 바뀐다-->
    <!-- ! 형식적인 구분선의 역활이 아니다.-->
     <blockquote>
        Lorem ipsum dolor sit amet consectetur adipisicing elit. Ducimus, qui officia aliquam facere,
    </blockquote>
     <q>
        Lorem ipsum dolor sit amet consectetur adipisicing elit. Ducimus, qui officia aliquam facere,
    </q>
    <!-- 디스플레이가 가지고 있는 속성값을 알아야한다 -->
    <!-- 영역이 필요하면 blockquote 공간을 따로 잡아서 강하게 강조하고 싶을때, 영역이 필요 없으면 q 문단 안에서 내용필요 -->
    
    <pre>
                                그대로 표현하기
------------------------------------------------------------------------------
분류1                       분류2                                      분류3
------------------------------------------------------------------------------
    </pre>
    <p>
                                그대로 표현하기
------------------------------------------------------------------------------
분류1                       분류2                                      분류3
------------------------------------------------------------------------------
    </p>
</body>
</html>
